a = input('Введите целое число от 1 до 12: ')
if a.isdigit() and 0 < int(a) <= 12:
    season = ["Зима", "Весна", "Лето", "Осень", "Зима"]
    month_dict = {
        "1": "Январь",
        "2": "Февраль",
        "3": "Март",
        "4": "Апрель",
        "5": "Май",
        "6": "Июнь",
        "7": "Июль",
        "8": "Август",
        "9": "Сентябрь",
        "10": "Октябрь",
        "11": "Ноябрь",
        "12": "Декабрь"
    }
    print(f'Время года: {season[int(a) // 3]}, Месяц: {month_dict.get(a)}')
else:
    print('Ошибка!')
